###
data.coffee
Copyright (C) 2013 ender xu <xuender@gmail.com>

Distributed under terms of the MIT license.
###
START = 0
END = 1
SELECT = 2
INPUT = 3
CHECK = 4

PAGE = [
  {
    type: START
  }
  {
    type: SELECT
    title: '对谁进行测试？'
    p: '由于“医不自医”自己无法看清自己的原因，你需要选择'
    items: [
      '自己'
      '亲友'
    ]
  }
  {
    type: INPUT
    title: '请输入被测试人的称呼'
    p: '测试结果上显示的称呼'
  }
  {
    type: CHECK
    title: "的面部特征有那些？"
    p: '查看以下面部特征，选择合适的，可多选'
    items: [
      {l: '长瘦',       v: '木'}
      {l: '露骨',       v: '木'}
      {l: '上宽下窄',   v: '木'}
      {l: '瓜子脸',     v: '木'}
      {l: '高鼻梁',     v: '木'}
      {l: '青筋暴露',   v: '木'}
      {l: '髪际窄很稀', v: '木'}
      {l: '宽天庭',     v: '木'}

      {l: '上尖中宽',     v: '火'}
      {l: '面丰满',       v: '火'}
      {l: '枣核脸',       v: '火'}
      {l: '宽额头',       v: '火'}
      {l: '眉高瘦削',     v: '火'}
      {l: '毛发稀疏',     v: '火'}
      {l: '赤红面',       v: '火'}
      {l: '尖头顶如火苗', v: '火'}
      {l: '拔顶或秃顶',   v: '火'}
      {l: '肉多横纹',     v: '火'}

      {l: '面丰厚',   v: '土'}
      {l: '方脸',     v: '土'}
      {l: '唇厚',     v: '土'}
      {l: '方圆脸',   v: '土'}
      {l: '平头顶',   v: '土'}
      {l: '鼻头多肉', v: '土'}
      {l: '桔皮脸',   v: '土'}
      {l: '耳朵大',   v: '土'}
      {l: '蒜头鼻子', v: '土'}
      {l: '口部丰满', v: '土'}

      {l: '面长方',     v: '金'}
      {l: '颧稍高',     v: '金'}
      {l: '唇薄齿利',   v: '金'}
      {l: '眉清目秀',   v: '金'}
      {l: '皮肤白细',   v: '金'}
      {l: '皮肤粗糙',   v: '金'}
      {l: '齿白',       v: '金'}
      {l: '平顶细眉',   v: '金'}
      {l: '肉纹细腻',   v: '金'}

      {l: '面形肥',     v: '水'}
      {l: '面漫团',     v: '水'}
      {l: '面下稍宽',   v: '水'}
      {l: '眉粗',       v: '水'}
      {l: '目大',       v: '水'}
      {l: '双下巴',     v: '水'}
    ]
  }
  {
    type: CHECK
    title: "发怒时面色是什么样的？"
    p: '看以下特征，选择合适的，可多选'
    items: [
      {l: '面带凶气', v: '木'}
      {l: '面色发青', v: '木'}
      {l: '面红耳赤', v: '火'}
      {l: '面色发黄', v: '土'}
      {l: '面色苍白', v: '金'}
      {l: '面色发暗', v: '水'}
      {l: '面色发黑', v: '水'}
    ]
  }
  {
    type: CHECK
    title: "的体型及行动表现有那些？"
    p: '查看以下身体特征，选择合适的，可多选'
    items: [
      {l: '身材细高',       v: '木'}
      {l: '肩背耸直',       v: '木'}
      {l: '平肩',           v: '木'}
      {l: '气度轩昂',       v: '木'}
      {l: '走路高压有声',   v: '木'}
      {l: '发板',           v: '木'}
      {l: '头晃摇',         v: '木'}
      {l: '穿衣整齐',       v: '木'}
      {l: '坐立时不斜不倚', v: '木'}
      {l: '站有站相',       v: '木'}
      {l: '坐有坐相',       v: '木'}

      {l: '背隆腰厚',     v: '土'}
      {l: '行动稳重',     v: '土'}
      {l: '肩厚',         v: '土'}
      {l: '五短身材',     v: '土'}
      {l: '背厚',         v: '土'}
      {l: '唇厚',         v: '土'}
      {l: '手背厚',       v: '土'}
      {l: '肌肉发达',     v: '土'}
      {l: '平头顶',       v: '土'}
      {l: '坐立沉稳',     v: '土'}
      {l: '行动重实',     v: '土'}
      {l: '气度厚重安祥', v: '土'}
      {l: '不慌张',       v: '土'}

      {l: '走路摇摆',     v: '火'}
      {l: '行动急速',     v: '火'}
      {l: '气度岸然',     v: '火'}
      {l: '坐立摇摆不安', v: '火'}
      {l: '轻举妄动',     v: '火'}
      {l: '脚步急快',     v: '火'}

      {l: '身段苗条',     v: '金'}
      {l: '举止轻灵',     v: '金'}
      {l: '气度活泼',     v: '金'}
      {l: '身段不高',     v: '金'}
      {l: '小巧玲珑',     v: '金'}
      {l: '瞻前顾后',     v: '金'}
      {l: '进退文雅',     v: '金'}
      {l: '举止做作',     v: '金'}
      {l: '行动灵活',     v: '金'}

      {l: '行动迟缓',     v: '水'}
    ]
  }
  {
    type: CHECK
    title: "说话特点有那些？"
    p: '查看以下语言特征，选择合适的，多选'
    items: [
      {l: '语音直而短',     v:'木'}
      {l: '齿音重',         v:'木'}
      {l: '直硬倔强',       v:'木'}

      {l: '说话声音尖多破', v:'火'}
      {l: '舌音重',         v:'火'}

      {l: '语音宽宏',       v:'土'}
      {l: '唇音重',         v:'土'}

      {l: '声音响亮',       v:'金'}
      {l: '唇音响亮圆润',   v:'金'}

      {l: '语音慢而低',     v:'水'}
      {l: '喉音重',         v:'水'}
    ]
  }
  {
    type: END
    title: '测试结果'
    p: '本测试结果仅供参考'
  }
]
