###
data.coffee
Copyright (C) 2013 ender xu <xuender@gmail.com>

Distributed under terms of the MIT license.
###
START = 0
END = 1
SELECT = 2
INPUT = 3
CHECK = 4

PAGE = [
  {
    type: START
  }
  {
    type: INPUT
    title: '请输入被测试人的称呼'
    p: '测试结果上显示的称呼'
  }
  {
    type: SELECT
    title: '的性别？'
    p: '男女五行属性不同，测试结果也不相同'
    items: [
      '男'
      '女'
    ]
  }
  {
    type: CHECK
    title: "的面部特征有那些？"
    p: '查看以下面部特征，选择合适的，可多选'
    items: [
      {l: '头顶平',     v: '木'}
      {l: '脸少肉',     v: '木'}
      {l: '脸部长瘦',   v: '木'}
      {l: '高颧骨',     v: '木'}
      {l: '瓜子脸',     v: '木'}
      {l: '高鼻梁',     v: '木'}
      {l: '青筋暴露',   v: '木'}
      {l: '髪际窄很稀', v: '木'}
      {l: '上宽下窄',   v: '木'}

      {l: '头顶尖',       v: '火'}
      {l: '嘴巴短',       v: '火'}
      {l: '枣核脸',       v: '火'}
      {l: '眉高瘦削',     v: '火'}
      {l: '毛发稀疏',     v: '火'}
      {l: '拔顶或秃顶',   v: '火'}
      {l: '赤红面',       v: '火'}
      {l: '上尖中宽',     v: '火'}
      {l: '面丰满',       v: '火'}
      {l: '肉多横纹',     v: '火'}

      {l: '头多肉',   v: '土'}
      {l: '嘴巴方',   v: '土'}
      {l: '四方圆脸', v: '土'}
      {l: '唇厚',     v: '土'}
      {l: '蒜头鼻子', v: '土'}
      {l: '面丰厚',   v: '土'}
      {l: '耳朵大',   v: '土'}
      {l: '平头顶',   v: '土'}
      {l: '鼻头多肉', v: '土'}
      {l: '桔皮脸',   v: '土'}
      {l: '方圆脸',   v: '土'}
      {l: '口部丰满', v: '土'}

      {l: '脸皮薄',     v: '金'}
      {l: '嘴巴长方',   v: '金'}
      {l: '面长方',     v: '金'}
      {l: '颧稍高',     v: '金'}
      {l: '唇薄齿利',   v: '金'}
      {l: '眉清目秀',   v: '金'}
      {l: '皮肤白细',   v: '金'}
      {l: '齿白',       v: '金'}
      {l: '平顶细眉',   v: '金'}
      {l: '肉纹细腻',   v: '金'}

      {l: '面形肥',     v: '水'}
      {l: '嘴巴小',     v: '水'}
      {l: '脸肉下垂',   v: '水'}
      {l: '面下稍宽',   v: '水'}
      {l: '眉粗',       v: '水'}
      {l: '目大',       v: '水'}
      {l: '双下巴',     v: '水'}
      {l: '面漫团',     v: '水'}
    ]
  }
  {
    type: CHECK
    title: "发怒时是什么样的？"
    p: '看以下特征，选择合适的，单选'
    items: [
      {l: '面发青或带凶', v: '木'}

      {l: '面红耳赤', v: '火'}

      {l: '面色发黄', v: '土'}

      {l: '面色苍白', v: '金'}

      {l: '面色发黑发暗', v: '水'}
    ]
  }
  {
    type: CHECK
    title: "说话特点有那些？"
    p: '查看以下语言特征，选择合适的，可多选'
    items: [
      {l: '语音直而短',     v: '木'}
      {l: '齿音重',         v: '木'}
      {l: '直硬倔强',       v: '木'}

      {l: '说话声音尖多破', v: '火'}
      {l: '舌音重',         v: '火'}

      {l: '语音宽宏',       v: '土'}
      {l: '唇音重',         v: '土'}

      {l: '声音响亮',       v: '金'}
      {l: '唇音响亮圆润',   v: '金'}

      {l: '语音慢而低',     v: '水'}
      {l: '喉音重',         v: '水'}
    ]
  }
  {
    type: CHECK
    title: "的体型及行动表现？"
    p: '查看以下身体特征，选择合适的，可多选'
    items: [
      {l: '两背直而平宽',   v: '木'}
      {l: '腰细长',         v: '木'}
      {l: '四肢长',         v: '木'}
      {l: '上宽下窄如树',   v: '木'}
      {l: '身材细高',       v: '木'}
      {l: '气度轩昂',       v: '木'}
      {l: '走路高压有声',   v: '木'}
      {l: '坐立时不斜不倚', v: '木'}
      {l: '穿衣整齐',       v: '木'}
      {l: '肩背耸直',       v: '木'}
      {l: '平肩',           v: '木'}
      {l: '发板',           v: '木'}
      {l: '头晃摇',         v: '木'}
      {l: '站有站相',       v: '木'}
      {l: '坐有坐相',       v: '木'}

      {l: '肩背方圆',     v: '土'}
      {l: '背多肉',       v: '土'}
      {l: '腰宽板直',     v: '土'}
      {l: '背隆腰厚',     v: '土'}
      {l: '行动稳重',     v: '土'}
      {l: '五短身材',     v: '土'}
      {l: '肌肉发达',     v: '土'}
      {l: '不慌张',       v: '土'}
      {l: '肩厚背厚',     v: '土'}
      {l: '手背厚',       v: '土'}
      {l: '坐立沉稳',     v: '土'}
      {l: '行动重实',     v: '土'}
      {l: '气度厚重安祥', v: '土'}

      {l: '腰圆',         v: '火'}
      {l: '胸背饱满不缺', v: '火'}
      {l: '腰下宽粗',     v: '火'}
      {l: '上尖下阔',     v: '火'}
      {l: '走路摇摆',     v: '火'}
      {l: '行动急速',     v: '火'}
      {l: '坐立摇摆不安', v: '火'}
      {l: '轻举妄动',     v: '火'}
      {l: '脚步急快',     v: '火'}

      {l: '身段苗条',     v: '金'}
      {l: '举止轻灵',     v: '金'}
      {l: '气度活泼',     v: '金'}
      {l: '瞻前顾后',     v: '金'}
      {l: '行动灵活',     v: '金'}
      {l: '进退文雅',     v: '金'}
      {l: '举止做作',     v: '金'}
      {l: '身段不高',     v: '金'}
      {l: '小巧玲珑',     v: '金'}

      {l: '腰肥圆',       v: '水'}
      {l: '前胸多肉',     v: '水'}
      {l: '腿短',         v: '水'}
      {l: '行动迟缓',     v: '水'}
      {l: '坐立好依扶',   v: '水'}
      {l: '萎靡不振',     v: '水'}
      {l: '气度缓和',     v: '水'}
    ]
  }
  {
    type: CHECK
    title: "患有那些病症？"
    p: '查看以下病症特征，选择合适的，多选'
    items: [
      {l: '肝病',         v: '木'}
      {l: '头迷眼干',     v: '木'}
      {l: '四肢无力',     v: '木'}
      {l: '胸肋疼痛',     v: '木'}
      {l: '胃腹膨胀',     v: '木'}

      {l: '心跳心慌',     v: '火'}
      {l: '心热吐血',     v: '火'}
      {l: '头晕目眩',     v: '火'}
      {l: '神经错乱',     v: '火'}

      {l: '脾胃虚弱',     v: '土'}
      {l: '上吐下泻',     v: '土'}
      {l: '消化不良',     v: '土'}
      {l: '食欲不振',     v: '土'}
      {l: '大肚子病',     v: '土'}

      {l: '肺病',         v: '金'}
      {l: '咳嗽痰喘',     v: '金'}
      {l: '气不足',       v: '金'}

      {l: '腰腿痛',       v: '水'}
      {l: '偏身痛',       v: '水'}
      {l: '肾病',         v: '水'}
      {l: '腹痛',         v: '水'}
      {l: '没精神',       v: '水'}
    ]
  }
  {
    type: CHECK
    title: "性格提点有那些？"
    p: '查看以下性格特点，选择合适的，多选'
    hide: '自己'
    items: [
      {l: '直率',      v: '木'}
      {l: '能立功',    v: '木'}
      {l: '擅经营',    v: '木'}
      {l: '心直口快',  v: '木'}
      {l: '喜正直',    v: '木'}
      {l: '憎恶邪恶',  v: '木'}
      {l: '憎恶虚假',  v: '木'}


      {l: '做事爽快',       v: '火'}
      {l: '勇猛不辞劳苦',   v: '火'}
      {l: '这山望着那山高', v: '火'}
      {l: '多贪外事',       v: '火'}

      {l: '诚实',           v: '土'}
      {l: '不会欺妄',       v: '土'}
      {l: '以作到底',       v: '土'}
      {l: '出力不讨好',     v: '土'}
      {l: '受劳受怨',       v: '土'}

      {l: '人情圆到',       v: '金'}
      {l: '看风使船',       v: '金'}
      {l: '不得罪人',       v: '金'}
      {l: '做活不用人操心', v: '金'}

      {l: '细密稳当',       v: '水'}
      {l: '缓和',           v: '水'}
      {l: '不慌张',         v: '水'}
      {l: '好生回头气',     v: '水'}
    ]
  }
  {
    type: END
    title: '测试结果'
    p: '本测试结果仅供参考'
  }
]

REPORT =
  '木':
    t: [
      '木主仁德，正直有主意，有担当力，敢做敢当，好生恶杀，公而无私，心口如一。遇事不盲从，有定见。处事不谄谀，行为端正，能忍辱。'
      '所以先生说：“木是能立的”。常存悲天悯人之心，化俗救世之愿，舍己为人，古往今来，凡成大业者，皆俱阳木之性。'
    ]
    g: [
      '要省出仁德心，亲亲仁民而爱物。合群爱众。能受屈。遇事服人。问性问主意。'
    ]
    f: [
      '粗暴，出言撞人，好阴沉，因小失大，以私害公，以情悖理，性多偏激，执拗顽梗，高傲自大，不易接近。不服人，好毁谤，掘人隐私，好抗上，宁折不弯，不爱接受意见，做事不许人反驳，器量窄小，不耐激触，难成事功。在家庭多亏孝道。平生遇事多难，常不如意，因之怒气填胸，愈形乖戾。'
    ]
    '火':
      '男':
        y: '顺'
        p: '一定主意。仁德为怀。回光返照。蔼蔼和和。爱人爱物。自自然然。乐乐和和'
      '女':
        y: '逆'
        p: '直憨不说理。有暗主意。凶狠好挑理。不服人。做事有始无终。克男。男不死，伤儿女。受苦受穷。肝气不平。心发烧'
    '水':
      '男':
        y: '逆'
        p: '有暗主意。预作而又不作。无定向。烦人。多忧思。做事说话不痛快。克妻。破财。肝经不平。肾经虚弱病'
      '女':
        y: '顺'
        p: '有一定主意。不着急。内无事。外一片和气。'
    '土':
      y: '克'
      p: '放大楚。闷气。胃发堵。有固执性。不服人。心有口说不出闷住。脾胃受伤。膨闷胀饱。上吐下泻。胁胀，气短等病'
  '火':
    t: [
      '光明磊落，通情达理，温恭安详，守礼守分，文采节制，表度有章，聪明谦让，举止大方，事无巨细，考虑周详。能高瞻远瞩明理达时，有“无入而不自得”之象。所以先生说：“火是拨正的。”古今创制大经大法的伟人哲士，皆是阳火性的功能。'
    ]
    g: [
      '需以恭敬辞让为心，遇事回光返照。克己复礼。责己达时。问性问明理。'
    ]
    f: [
      '急躁多贪，喜虚荣，好夸张，行多狂妄，奔高贪好，争名逐利。外明内暗，见人不见己，知进不知退，得理不让人。常以屑琐细故，致使全家不欢。欺负老实人，吹毛求疵，好争理，喜奉承。可与共患难，不可与共富贵。做事虎头蛇尾，态度拘谨，行多过失，屡改屡犯。老年多昏馈。'
    ]
    '土':
      '男':
        y: '顺'
        p: '回光返照。不急不慌。明理识时。信人知命。待人诚实。无有虚伪。'
      '女':
        y: '逆'
        p: '不明理，而挑理。好生闷气。忧思无定。怨人。心跳心慌。欲食无味。'
    '木':
      '男':
        y: '逆'
        p: '爱好贪高。不服人。以非为是。自以为有理。遇有劝说。坚持不服。心忙心跳。四肢麻木。头痛。走到极处，四五十岁，成孤独命。'
      '女':
        y: '顺'
        p: '明理不燥。克己复礼。有主意。爱行仁德。'
    '金':
      y: '克'
      p: '好操心。见事必要分。伤钱财。伤儿孙。爱好贪高。喜辩论。肺痨肺结核。咳嗽痰喘等症'
  '土':
    t: [
      '信实忠厚，笃诚淳朴，宽宏大量，能容能化，勤俭朴素，克尽职责，举止稳重，言行一致，为人谋而忠，与人交而久。'
      '所以先生说：“土是存良心的。”对奇才异能，可兼收并蓄，厚德载物，为成功之母。'
    ]
    g: [
      '需明因果。遇事生出信心，宽宏大量。问性问信实。'
    ]
    f: [
      '固执呆板，朴拙，思想单纯，蠢笨蛮横，心小量窄，近于愚直，易上当受骗。不开通，言信行果，未必中理。寡言少语，好生怨气，疑心特大，无中生有，以假当真。一生多累。'
    ]
    '水':
      y: '克'
      p: '咧大嘴。遇事必后悔。好生回头气。死把。闷气。忧虑不断。低头皱眉。肾虚肾痨。腰腿痛。精神颓萎'
    '金':
      '男':
        y: '顺'
        p: '忠厚老诚。实心实意。明因果。无假情。有义气。清理圆满。'
      '女':
        y: '逆'
        p: '好生闷气。多疑心。固执多假。无义气。脾弱。气短。食膈。'
    '火':
      '男':
        y: '逆'
        p: '闷气。疑心。死把。好挑理。发烧发热。上酸水。不思饮食。'
      '女':
        y: '顺'
        p: '无死把固执性。诚实忠厚。明因果。知进退。明理信人。'
  '金':
    t: [
      '主义气，性豪爽，善交际，善言谈，活泼开朗，敏捷果断，取人之长，知过必改。危难不避，劳怨弗辞，见义勇为，见得思义。'
      '所以凤仪先生说：“金是分清的。”善于判别善恶是非真伪。古今成大功的奇才义士，光彩人物，多属阳金之功力。'
    ]
    g: [
      '需生出大义。遇事找人好处。问性问响亮。'
    ]
    f: [
      '多虚假，好分辩，喜变更，虚妄不实，咀甜心苦，好冷笑，习于谄媚。更为甚者，残忍嫉妒，巧言令色，笑里藏刀。妒功害能，掩人善行，喜闻人过，好言人短，刻薄寡恩，得权在位，便能乱世，凶奸之徒，多由此出。在家庭，则父子责善，夫妻寡义，分崩离析。'
    ]
    '水':
      '男':
        y: '顺'
        p: '能认不是。谦恭和蔼。无假人情。随圆就方。活泼自然。而不烦人。'
      '女':
        y: '逆'
        p: '假人情。假圆到。好烦人。肺寒腰腿痛。'
    '土':
      '男':
        y: '逆'
        p: '假圆到。心多疑而不实。凡事不落底。有理说不透彻。气短上痰。'
      '女':
        y: '顺'
        p: '刚毅果断。有义气。能容能让。真实无假。'
    '木':
      y: '克'
      p: '不发富。做事难迈步。不服人。找棱缝。肝气不舒。四肢麻木无力。头迷眼干。半身不遂。胸肋痛。'
  '水':
    t: [
      '活泼自然，随遇而安。沉稳雅静，智慧巧思，和万缘而不变。恬淡虚静，涵养力强，功成不居。真水主智慧，性柔和，智慧之光，无处不照。'
      '所以凤仪先生说：“水是周遍一切的。”古人淡泊明志，必宁静致远。中外发明家，多为阳水之功能。'
    ]
    g: [
      '需矮和。生出明智。遇事认不是。问性问柔和。'
    ]
    f: [
      '多愚鲁，好烦闷，遇事退缩，习惯邋遢。行多迂阔，多忧多虑，自卑自弃。好抱屈，喜生回头气，优柔寡断，缺独立性，进退失据，处事失机后时。一生多受气。'
    ]
    '木':
      '男':
        y: '顺'
        p: '聪慧灵明。柔和。能受屈。有一定主宰和而不流。'
      '女':
        y: '逆'
        p: '恼而不能受屈。以个人主意为主。出言撞人。无正向。肾寒肝气不舒。'
    '金':
      '男':
        y: '逆'
        p: '内不乐意。外假圆到。腰腿痛。气短。肾寒肺弱。好生浮皮疮。'
      '女':
        y: '顺'
        p: '活泼。不烦人。智慧。伶俐。找人好处。清理周密。'
    '火':
      y: '克'
      p: '无处躲。办事好退缩。奔好自欺。忧思后悔。心跳心热。心忙心痛。头晕目眩。神经错乱。吐血。'
